In [164]:
userDB = ###
passwordDB = ####
hostDB = ###
port=  ##
db = ###

string = 'mysql+pymysql://'+userDB+':'+passwordDB+'@'+hostDB+':'+port+'/'+db

In [165]:
import pandas as pd
import sqlalchemy as db
import pymssql

from sqlalchemy import create_engine


engine = create_engine(
    string
    ,echo = True)

connection = engine.connect()

2020-06-29 16:39:07,507 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2020-06-29 16:39:07,510 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:39:07,619 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2020-06-29 16:39:07,622 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:39:07,839 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2020-06-29 16:39:07,841 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:39:08,053 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2020-06-29 16:39:08,055 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:39:08,171 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2020-06-29 16:39:08,173 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:39:08,282 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2020-06-29 16:39:08,284 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:39:08,395 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2020-06-29 16:39:08,397 INFO sqlalchemy.engine.base.Engine {}

In [170]:
metadata = db.MetaData()

In [137]:
viaje = db.Table('Viaje', metadata, autoload=True, autoload_with=engine)

2020-06-29 16:16:09,424 INFO sqlalchemy.engine.base.Engine SHOW CREATE TABLE `Viaje`
2020-06-29 16:16:09,427 INFO sqlalchemy.engine.base.Engine {}

In [141]:
viaje

Table('Viaje', MetaData(bind=None), Column('Fecha', VARCHAR(length=45), table=<Viaje>), Column('Viaje_Id', VARCHAR(length=45), table=<Viaje>), Column('Usuario_Id', VARCHAR(length=12), table=<Viaje>), Column('Genero', VARCHAR(length=5), table=<Viaje>), Column('Inicio_del_viaje', VARCHAR(length=45), table=<Viaje>), Column('Fin_del_viaje', VARCHAR(length=45), table=<Viaje>), Column('Origen_Id', VARCHAR(length=12), table=<Viaje>), Column('Destino_Id', VARCHAR(length=12), table=<Viaje>), Column('duracion_viaje', TIME(), table=<Viaje>), schema=None)

In [142]:
viaje.columns.keys()

['Fecha',
 'Viaje_Id',
 'Usuario_Id',
 'Genero',
 'Inicio_del_viaje',
 'Fin_del_viaje',
 'Origen_Id',
 'Destino_Id',
 'duracion_viaje']

In [57]:
query = 'SELECT * FROM Viaje limit 10'

result = connection.execute(query)

2020-06-29 13:23:04,469 INFO sqlalchemy.engine.base.Engine SELECT * FROM Viaje limit 10
2020-06-29 13:23:04,470 INFO sqlalchemy.engine.base.Engine {}

In [58]:
result = result.fetchall()

In [60]:
pd.DataFrame(result)

,0,1,2,3,4,5,6,7,8
0,01/01/2018,4783525,28966,M,01/01/2018 06:01:00 a. m.,01/01/2018 06:10:00 a. m.,59,28,00:09:00
1,01/01/2018,4783526,30089,M,01/01/2018 06:03:00 a. m.,01/01/2018 06:06:00 a. m.,250,164,00:03:00
2,01/01/2018,4783527,32691,M,01/01/2018 06:09:00 a. m.,01/01/2018 06:15:00 a. m.,148,238,00:06:00
3,01/01/2018,4783528,19027,M,01/01/2018 06:16:00 a. m.,01/01/2018 06:26:00 a. m.,202,51,00:10:00
4,01/01/2018,4783529,27154,M,01/01/2018 06:19:00 a. m.,01/01/2018 06:24:00 a. m.,11,173,00:05:00
5,01/01/2018,4783530,32199,M,01/01/2018 06:24:00 a. m.,01/01/2018 06:35:00 a. m.,250,167,00:11:00
6,01/01/2018,4783531,16942,M,01/01/2018 06:30:00 a. m.,01/01/2018 06:41:00 a. m.,42,191,00:11:00
7,01/01/2018,4783532,32705,F,01/01/2018 06:32:00 a. m.,01/01/2018 06:49:00 a. m.,86,160,00:17:00
8,01/01/2018,4783533,9596,M,01/01/2018 06:32:00 a. m.,01/01/2018 06:49:00 a. m.,86,160,00:17:00
9,01/01/2018,4783534,17818,M,01/01/2018 06:32:00 a. m.,01/01/2018 06:48:00 a. m.,165,167,00:16:00

In [65]:
pd.DataFrame(result, columns = connection.execute(query).keys())

2020-06-29 13:27:44,217 INFO sqlalchemy.engine.base.Engine SELECT * FROM Viaje limit 10
2020-06-29 13:27:44,218 INFO sqlalchemy.engine.base.Engine {}

,Fecha,Viaje_Id,Usuario_Id,Genero,Inicio_del_viaje,Fin_del_viaje,Origen_Id,Destino_Id,duracion_viaje
0,01/01/2018,4783525,28966,M,01/01/2018 06:01:00 a. m.,01/01/2018 06:10:00 a. m.,59,28,00:09:00
1,01/01/2018,4783526,30089,M,01/01/2018 06:03:00 a. m.,01/01/2018 06:06:00 a. m.,250,164,00:03:00
2,01/01/2018,4783527,32691,M,01/01/2018 06:09:00 a. m.,01/01/2018 06:15:00 a. m.,148,238,00:06:00
3,01/01/2018,4783528,19027,M,01/01/2018 06:16:00 a. m.,01/01/2018 06:26:00 a. m.,202,51,00:10:00
4,01/01/2018,4783529,27154,M,01/01/2018 06:19:00 a. m.,01/01/2018 06:24:00 a. m.,11,173,00:05:00
5,01/01/2018,4783530,32199,M,01/01/2018 06:24:00 a. m.,01/01/2018 06:35:00 a. m.,250,167,00:11:00
6,01/01/2018,4783531,16942,M,01/01/2018 06:30:00 a. m.,01/01/2018 06:41:00 a. m.,42,191,00:11:00
7,01/01/2018,4783532,32705,F,01/01/2018 06:32:00 a. m.,01/01/2018 06:49:00 a. m.,86,160,00:17:00
8,01/01/2018,4783533,9596,M,01/01/2018 06:32:00 a. m.,01/01/2018 06:49:00 a. m.,86,160,00:17:00
9,01/01/2018,4783534,17818,M,01/01/2018 06:32:00 a. m.,01/01/2018 06:48:00 a. m.,165,167,00:16:00

In [81]:
from sqlalchemy import select
#from sqlalchemy.sql import text

In [88]:
pySQL = select([viaje])

In [89]:
results2 = connection.execute(pySQL).fetchmany(size=10)

2020-06-29 13:46:40,229 INFO sqlalchemy.engine.base.Engine SELECT `Viaje`.`Fecha`, `Viaje`.`Viaje_Id`, `Viaje`.`Usuario_Id`, `Viaje`.`Genero`, `Viaje`.`Inicio_del_viaje`, `Viaje`.`Fin_del_viaje`, `Viaje`.`Origen_Id`, `Viaje`.`Destino_Id`, `Viaje`.duracion_viaje
FROM `Viaje`
2020-06-29 13:46:40,231 INFO sqlalchemy.engine.base.Engine {}

In [92]:
pd.DataFrame(results2)

,0,1,2,3,4,5,6,7,8
0,01/01/2018,4783525,28966,M,01/01/2018 06:01:00 a. m.,01/01/2018 06:10:00 a. m.,59,28,00:09:00
1,01/01/2018,4783526,30089,M,01/01/2018 06:03:00 a. m.,01/01/2018 06:06:00 a. m.,250,164,00:03:00
2,01/01/2018,4783527,32691,M,01/01/2018 06:09:00 a. m.,01/01/2018 06:15:00 a. m.,148,238,00:06:00
3,01/01/2018,4783528,19027,M,01/01/2018 06:16:00 a. m.,01/01/2018 06:26:00 a. m.,202,51,00:10:00
4,01/01/2018,4783529,27154,M,01/01/2018 06:19:00 a. m.,01/01/2018 06:24:00 a. m.,11,173,00:05:00
5,01/01/2018,4783530,32199,M,01/01/2018 06:24:00 a. m.,01/01/2018 06:35:00 a. m.,250,167,00:11:00
6,01/01/2018,4783531,16942,M,01/01/2018 06:30:00 a. m.,01/01/2018 06:41:00 a. m.,42,191,00:11:00
7,01/01/2018,4783532,32705,F,01/01/2018 06:32:00 a. m.,01/01/2018 06:49:00 a. m.,86,160,00:17:00
8,01/01/2018,4783533,9596,M,01/01/2018 06:32:00 a. m.,01/01/2018 06:49:00 a. m.,86,160,00:17:00
9,01/01/2018,4783534,17818,M,01/01/2018 06:32:00 a. m.,01/01/2018 06:48:00 a. m.,165,167,00:16:00

# Creación de una Tabla

In [143]:
ejemplo = db.Table('ejemplo', metadata,
              db.Column('Id', db.Integer()),
              db.Column('name', db.String(255)),
              db.Column('salary', db.Float(), default=100.0),
              db.Column('active', db.Boolean(), default=True)
              )

metadata.create_all(engine)

2020-06-29 16:17:39,249 INFO sqlalchemy.engine.base.Engine DESCRIBE `Viaje`
2020-06-29 16:17:39,251 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:17:39,357 INFO sqlalchemy.engine.base.Engine DESCRIBE `ejemplo`
2020-06-29 16:17:39,359 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:17:39,466 INFO sqlalchemy.engine.base.Engine ROLLBACK
2020-06-29 16:17:39,573 INFO sqlalchemy.engine.base.Engine
CREATE TABLE ejemplo (
	`Id` INTEGER,
	name VARCHAR(255),
	salary FLOAT,
	active BOOL,
	CHECK (active IN (0, 1))
)


2020-06-29 16:17:39,575 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:17:39,706 INFO sqlalchemy.engine.base.Engine COMMIT

In [144]:
#Inserting record one by one
query = db.insert(ejemplo).values(Id=1, name='Hugo', salary=60000.00, active=True) 
results = connection.execute(query)

2020-06-29 16:17:47,616 INFO sqlalchemy.engine.base.Engine INSERT INTO ejemplo (`Id`, name, salary, active) VALUES (%(Id)s, %(name)s, %(salary)s, %(active)s)
2020-06-29 16:17:47,617 INFO sqlalchemy.engine.base.Engine {'Id': 1, 'name': 'Hugo', 'salary': 60000.0, 'active': 1}
2020-06-29 16:17:47,742 INFO sqlalchemy.engine.base.Engine COMMIT

In [145]:
query = db.insert(ejemplo) 
values_list = [{'Id':'2',
                'name':'Paco', 'salary':80000, 'active':False},
               {'Id':'3', 'name':'Luis', 'salary':70000, 'active':True}]
results = connection.execute(query,values_list)

2020-06-29 16:18:30,648 INFO sqlalchemy.engine.base.Engine INSERT INTO ejemplo (`Id`, name, salary, active) VALUES (%(Id)s, %(name)s, %(salary)s, %(active)s)
2020-06-29 16:18:30,650 INFO sqlalchemy.engine.base.Engine ({'Id': '2', 'name': 'Paco', 'salary': 80000, 'active': 0}, {'Id': '3', 'name': 'Luis', 'salary': 70000, 'active': 1})
2020-06-29 16:18:30,758 INFO sqlalchemy.engine.base.Engine COMMIT

In [157]:
results = connection.execute(db.select([ejemplo])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
pd.DataFrame(df)

2020-06-29 16:22:01,693 INFO sqlalchemy.engine.base.Engine SELECT ejemplo.`Id`, ejemplo.name, ejemplo.salary, ejemplo.active
FROM ejemplo
2020-06-29 16:22:01,695 INFO sqlalchemy.engine.base.Engine {}

   Id        name   salary  active
0   1        Hugo  60000.0    True
1   2        Paco  80000.0   False
2   3  Luis Nuevo  70000.0    True

   Id  name   salary  active
0   1  Hugo  60000.0    True
1   2  Paco  80000.0   False
2   3  Luis  70000.0    True

# Update

db.update(table_name).values(attribute = new_value).where(condition)

In [149]:
sql = "UPDATE ejemplo SET name='Luis Nuevo' WHERE Id =3"

In [156]:
results = connection.execute(sql)

2020-06-29 16:21:29,778 INFO sqlalchemy.engine.base.Engine UPDATE ejemplo SET name='Luis Nuevo' WHERE Id =3
2020-06-29 16:21:29,779 INFO sqlalchemy.engine.base.Engine {}
2020-06-29 16:21:29,885 INFO sqlalchemy.engine.base.Engine COMMIT

In [158]:
results = connection.execute(db.select([ejemplo])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
pd.DataFrame(df)

2020-06-29 16:22:07,521 INFO sqlalchemy.engine.base.Engine SELECT ejemplo.`Id`, ejemplo.name, ejemplo.salary, ejemplo.active
FROM ejemplo
2020-06-29 16:22:07,523 INFO sqlalchemy.engine.base.Engine {}

   Id        name   salary  active
0   1        Hugo  60000.0    True
1   2        Paco  80000.0   False
2   3  Luis Nuevo  70000.0    True

In [159]:
# Build a statement to update the salary to 100000
query = db.update(ejemplo).values(salary = 100000)
query = query.where(ejemplo.columns.Id == 1)
results = connection.execute(query)

2020-06-29 16:22:18,264 INFO sqlalchemy.engine.base.Engine UPDATE ejemplo SET salary=%(salary)s WHERE ejemplo.`Id` = %(Id_1)s
2020-06-29 16:22:18,265 INFO sqlalchemy.engine.base.Engine {'salary': 100000, 'Id_1': 1}
2020-06-29 16:22:18,398 INFO sqlalchemy.engine.base.Engine COMMIT

In [160]:
results = connection.execute(db.select([ejemplo])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
pd.DataFrame(df)

2020-06-29 16:22:22,148 INFO sqlalchemy.engine.base.Engine SELECT ejemplo.`Id`, ejemplo.name, ejemplo.salary, ejemplo.active
FROM ejemplo
2020-06-29 16:22:22,149 INFO sqlalchemy.engine.base.Engine {}

   Id        name    salary  active
0   1        Hugo  100000.0    True
1   2        Paco   80000.0   False
2   3  Luis Nuevo   70000.0    True

# Borrar Tablas

db.delete(table_name).where(condition)

In [166]:
query = db.delete(ejemplo).where(ejemplo.columns.salary < 100000)
results = connection.execute(query)

2020-06-29 16:39:21,654 INFO sqlalchemy.engine.base.Engine DELETE FROM ejemplo WHERE ejemplo.salary < %(salary_1)s
2020-06-29 16:39:21,655 INFO sqlalchemy.engine.base.Engine {'salary_1': 100000}
2020-06-29 16:39:21,779 INFO sqlalchemy.engine.base.Engine COMMIT

In [120]:
Bici = pd.read_csv('Bici.csv')

In [172]:
Estaciones = pd.read_csv('Join1.csv')

In [174]:
userDB = 'test'
passwordDB = 'prueba123'
hostDB = 'localhost'
port= '3306'
db = 'bisi'

string = 'mysql+pymysql://'+userDB+':'+passwordDB+'@'+hostDB+':'+port+'/'+db

In [175]:
engineLocal = create_engine(
    string)

local = engineLocal.connect()

In [121]:

# append the data from census_df to the "census" table via connection
Bici.to_sql(name="Bici", con=local, if_exists="append", index=False)

In [176]:

# append the data from census_df to the "census" table via connection
Estaciones.to_sql(name="Estaciones", con=local, if_exists="append", index=False)

In [ ]:
'''
if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’

    How to behave if the table already exists.

        fail: Raise a ValueError.

        replace: Drop the table before inserting new values.

        append: Insert new values to the existing table.